podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/IOCON_LPC82x.svd.xml
<!--
Devices using this peripheral: 
      LPC82x
-->
      <peripheral>
         <?sourceFile "IOCON_LPC82x" ?>
         <name>IOCON</name>
         <description>I/O configuration</description>
         <groupName>IOCON</groupName>
         <headerStructName>IOCON</headerStructName>
         <baseAddress>0x40044000</baseAddress>
         <size>32</size>
         <access>read-write</access>
         <resetValue>0x0</resetValue>
         <resetMask>0xFFFFFFFF</resetMask>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x30</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x34</offset>
            <size>0x18</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x50</offset>
            <size>0x2C</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>PIO0_17</name>
               <description>I/O configuration for pin PIO0_17</description>
               <addressOffset>0x0</addressOffset>
               <resetMask>0x0</resetMask>
               <fields>
                  <field>
                     <name>MODE</name>
                     <description>Selects function mode (on-chip pull-up/pull-down resistor control)</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>INACTIVE_NO_PULL_DO</name>
                           <description>Inactive (no pull-down/pull-up resistor enabled)</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PULL_DOWN_RESISTOR_E</name>
                           <description>Pull-down resistor enabled</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PULL_UP_RESISTOR_ENA</name>
                           <description>Pull-up resistor enabled</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>REPEATER_MODE</name>
                           <description>Repeater mode</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>HYS</name>
                     <description>Hysteresis</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>DISABLE</name>
                           <description>Disable</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLE</name>
                           <description>Enable</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>INV</name>
                     <description>Invert input</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>INPUT_NOT_INVERTED</name>
                           <description>Input not inverted (HIGH on pin reads as 1; LOW on pin reads as 0)</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INPUT_INVERTED_HIGH</name>
                           <description>Input inverted (HIGH on pin reads as 0, LOW on pin reads as 1)</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>OD</name>
                     <description>Open-drain mode</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>DISABLE</name>
                           <description>Disable</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OPEN_DRAIN_MODE_ENAB</name>
                           <description>Open-drain mode enabled.  This is not a true open-drain mode</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>S_MODE</name>
                     <description>Digital filter sample mode</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>BYPASS_INPUT_FILTER</name>
                           <description>Bypass input filter</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1_CLOCK_CYCLE</name>
                           <description>1 clock cycle. Input pulses shorter than one filter clock are rejected</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>2_CLOCK_CYCLES</name>
                           <description>2 clock cycles. Input pulses shorter than two filter clocks are rejected</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>3_CLOCK_CYCLES</name>
                           <description>3 clock cycles. Input pulses shorter than three filter clocks are rejected</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CLK_DIV</name>
                     <description>Select peripheral clock divider for input filter sampling clock. Value 0x7 is reserved</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>IOCONCLKDIV0</name>
                           <description>IOCONCLKDIV0</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>IOCONCLKDIV1</name>
                           <description>IOCONCLKDIV1</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>IOCONCLKDIV2</name>
                           <description>IOCONCLKDIV2</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>IOCONCLKDIV3</name>
                           <description>IOCONCLKDIV3</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>IOCONCLKDIV4</name>
                           <description>IOCONCLKDIV4</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>IOCONCLKDIV5</name>
                           <description>IOCONCLKDIV5</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>IOCONCLKDIV6</name>
                           <description>IOCONCLKDIV6</description>
                           <value>0x6</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register derivedFrom="PIO0_17"> <name>PIO0_13</name> <description>I/O configuration for pin PIO0_13</description> <addressOffset>0x4</addressOffset> </register>
            <register derivedFrom="PIO0_17"> <name>PIO0_12</name> <description>I/O configuration for pin PIO0_12</description> <addressOffset>0x8</addressOffset> </register>
            <register derivedFrom="PIO0_17"> <name>PIO0_5</name> <description>I/O configuration for pin PIO0_5/RESET</description> <addressOffset>0xC</addressOffset> </register>
            <register derivedFrom="PIO0_17"> <name>PIO0_4</name> <description>I/O configuration for pin PIO0_4</description> <addressOffset>0x10</addressOffset> <resetValue>0x90</resetValue> </register>
            <register derivedFrom="PIO0_17"> <name>PIO0_3</name> <description>I/O configuration for pin PIO0_3/SWCLK</description> <addressOffset>0x14</addressOffset> <resetValue>0x90</resetValue> </register>
            <register derivedFrom="PIO0_17"> <name>PIO0_2</name> <description>I/O configuration for pin PIO0_2/SWDIO</description> <addressOffset>0x18</addressOffset> <resetValue>0x90</resetValue> </register>
            <register derivedFrom="PIO0_17"> <name>PIO0_11</name> <description>I/O configuration for pin PIO0_11 (true open-drain)</description> <addressOffset>0x1C</addressOffset> </register>
            <register derivedFrom="PIO0_17"> <name>PIO0_10</name> <description>I/O configuration for pin PIO0_10 (true open-drain)</description> <addressOffset>0x20</addressOffset> </register>
            <register derivedFrom="PIO0_17"> <name>PIO0_16</name> <description>I/O configuration for pin PIO0_16</description> <addressOffset>0x24</addressOffset> </register>
            <register derivedFrom="PIO0_17"> <name>PIO0_15</name> <description>I/O configuration for pin PIO0_15</description> <addressOffset>0x28</addressOffset> </register>
            <register derivedFrom="PIO0_17"> <name>PIO0_1</name> <description>I/O configuration for pin PIO0_1</description> <addressOffset>0x2C</addressOffset> </register>
            <register derivedFrom="PIO0_17"> <name>PIO0_9</name> <description>I/O configuration for pin PIO0_9/XTALOUT</description> <addressOffset>0x34</addressOffset> <resetValue>0x90</resetValue> </register>
            <register derivedFrom="PIO0_17"> <name>PIO0_8</name> <description>I/O configuration for pin PIO0_8/XTALIN</description> <addressOffset>0x38</addressOffset> <resetValue>0x90</resetValue> </register>
            <register derivedFrom="PIO0_17"> <name>PIO0_7</name> <description>I/O configuration for pin PIO0_7</description> <addressOffset>0x3C</addressOffset> <resetValue>0x90</resetValue> </register>
            <register derivedFrom="PIO0_17"> <name>PIO0_6</name> <description>I/O configuration for pin PIO0_6/VDDCMP</description> <addressOffset>0x40</addressOffset> <resetValue>0x90</resetValue> </register>
            <register derivedFrom="PIO0_17"> <name>PIO0_0</name> <description>I/O configuration for pin PIO0_0/ACMP_I0</description> <addressOffset>0x44</addressOffset> <resetValue>0x90</resetValue> </register>
            <register derivedFrom="PIO0_17"> <name>PIO0_14</name> <description>I/O configuration for pin PIO0_14</description> <addressOffset>0x48</addressOffset> <resetValue>0x90</resetValue> </register>
            <register derivedFrom="PIO0_17"> <name>PIO0_28</name> <description>I/O configuration for pin PIO0_28</description> <addressOffset>0x50</addressOffset> </register>
            <register derivedFrom="PIO0_17"> <name>PIO0_27</name> <description>I/O configuration for pin PIO0_27</description> <addressOffset>0x54</addressOffset> </register>
            <register derivedFrom="PIO0_17"> <name>PIO0_26</name> <description>I/O configuration for pin PIO0_26</description> <addressOffset>0x58</addressOffset> </register>
            <register derivedFrom="PIO0_17"> <name>PIO0_25</name> <description>I/O configuration for pin PIO0_25</description> <addressOffset>0x5C</addressOffset> </register>
            <register derivedFrom="PIO0_17"> <name>PIO0_24</name> <description>I/O configuration for pin PIO0_24</description> <addressOffset>0x60</addressOffset> </register>
            <register derivedFrom="PIO0_17"> <name>PIO0_23</name> <description>I/O configuration for pin PIO0_23/ADC_3</description> <addressOffset>0x64</addressOffset> <resetValue>0x90</resetValue> </register>
            <register derivedFrom="PIO0_17"> <name>PIO0_22</name> <description>I/O configuration for pin PIO0_22/ADC_4</description> <addressOffset>0x68</addressOffset> <resetValue>0x90</resetValue> </register>
            <register derivedFrom="PIO0_17"> <name>PIO0_21</name> <description>I/O configuration for pin PIO0_21/ACMP_I4/ADC_5</description> <addressOffset>0x6C</addressOffset> <resetValue>0x90</resetValue> </register>
            <register derivedFrom="PIO0_17"> <name>PIO0_20</name> <description>I/O configuration for pin PIO0_20/ADC_6</description> <addressOffset>0x70</addressOffset> <resetValue>0x90</resetValue> </register>
            <register derivedFrom="PIO0_17"> <name>PIO0_19</name> <description>I/O configuration for pin PIO0_19/ADC_7</description> <addressOffset>0x74</addressOffset> <resetValue>0x90</resetValue> </register>
            <register derivedFrom="PIO0_17"> <name>PIO0_18</name> <description>I/O configuration for pin PIO0_18/ADC_8</description> <addressOffset>0x78</addressOffset> <resetValue>0x90</resetValue> </register>
         </registers>
      </peripheral>
